oredev_2018_rust_for_javascripters/presentation.org
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_EXTRA_CSS: /Users/s/Desktop/reactiveconf/talk.css
#+REVEAL_THEME: league
#+REVEAL_TRANS: linear
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_DEFAULT_FRAG_STYLE: appear
#+REVEAL_EXTRA_CSS: css/custom.css
#+OPTIONS: reveal_title_slide:nil num:nil reveal_history:true toc:nil
* Rust for JavaScripters
* Who am I?
- Sean Grove ([[https://twitter.com/sgrove][@sgrove]]), from SF
- Cofounder of ([[https://twitter.com/onegraphio][@OneGraphIO]])
- Shipped cross-compiled ARM IoT Rust project
- Background in Clojure(Script)/Reason/Rust
* The opening pitch
Working with Rust (in the beginning) is like banging your head against the wall
#+REVEAL: split
Let's set expectations!
#+ATTR_REVEAL: :frag appear
Caveat: Rust code will _always_※ be longer, more verbose, and more intricate than the JS alternative.





#+ATTR_REVEAL: :frag appear
※ ... not _always_, but close enough. It's a healthier mindset to go into Rust expecting thing.
* The language
#+BEGIN_QUOTE
Rust is a systems programming language that runs blazingly fast, prevents segfaults, and guarantees thread safety.
#+END_QUOTE
#+REVEAL: split
Rust for JavaScripters:

- low-level, but with abstractions
- guaranteed memory safety
- threads without data races
- pattern matching
- type inference
- minimal runtime
** Why "Low-level, but with abstractions"?

_Predictable performance_ from *control* over e.g. memory layout, collection.
** Why "Guaranteed memory safety"?

Manually ensuring data integrity is _tough_
** Why "Threads without data races"?

Manually ensuring data integrity with _concurrent access_ is _beyond tough_
** Why "Type inference"?

#+ATTR_REVEAL: :frag appear
What are types for?

#+ATTR_REVEAL: :frag appear
- C: Performance!
- Typescript/flow: Correctness!
- Rust: Correctness... and performance!

#+ATTR_REVEAL: :frag appear
- Java: Correctness... and performance?

#+REVEAL: split
#+BEGIN_SRC java
public class Prime {

    public static void main(String[] args) {

        int num = 29;
        boolean flag = false;
        for(int i = 2; i <= num/2; ++i)
        {
            if(num % i == 0)
            {
                flag = true;
                break;
            }
        }

        if (!flag)
            System.out.println(num + " is a prime number.");
        else
            System.out.println(num + " is not a prime number.");
    }
}
#+END_SRC
#+REVEAL: split
Can we do better?

#+ATTR_REVEAL: :frag appear
Type inference!
#+REVEAL: split

#+BEGIN_SRC rust
fn main() {
    // Because of the annotation, the compiler knows that `elem` has type u8.
    let elem = 5u8;
    // Create an empty vector (a growable array).
    let mut vec = Vec::new();
    // At this point the compiler doesn't know the exact type of `vec`, it
    // just knows that it's a vector of something (`Vec<_>`).
    // Insert `elem` in the vector.
    vec.push(elem);
    // Aha! Now the compiler knows that `vec` is a vector of `u8`s (`Vec u8`)
    println!("{:?}", vec);
}
#+END_SRC

#+ATTR_REVEAL: :frag appear
- Minimal type annotation of variables needed
#+ATTR_REVEAL: :frag appear
the compiler is happy
#+ATTR_REVEAL: :frag appear
and so is the programmer!
#+ATTR_REVEAL: :frag appear
- Wherever possible, the computer should do work for us
** Why "Minimal runtime"?

Delivery over the web puts pressure on payload size

#+ATTR_REVEAL: :frag appear
#+BEGIN_QUOTE
At present, Go generates large Wasm files, with the smallest possible size being around ~2MB. If your Go code imports libraries, this file size can increase dramatically. 10MB+ is common.
#+END_QUOTE

#+ATTR_REVEAL: :frag appear
(Go is rapidly improving here, with TinyGo outputting e.g. ~10kB )

** Why "Pattern matching"?

#+BEGIN_SRC rust
fn main() {
    let greetings = ["Hello", "안녕하세요", "Hej"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 => println!("This code is editable and runnable!"),
            1 => println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            2 => println!("Den här koden kan redigeras och köras!"),
        }
    }
}
#+END_SRC
#+REVEAL: split
Not just pattern matching, _exhaustive pattern matching_!
#+BEGIN_SRC rust
fn main() {
    let greetings = ["Hello", "안녕하세요", "Hej"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 => println!("This code is editable and runnable!"),
            1 => println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            2 => println!("Den här koden kan redigeras och köras!"),
        }
    }
}
#+END_SRC
#+BEGIN_SRC rust
error[E0004]: non-exhaustive patterns: `_` not covered
--> src/main.rs:6:15
  |
6 |         match num {
  |               ^^^ pattern `_` not covered
For more information about this error, try `rustc --explain E0004`.
#+END_SRC
#+REVEAL: split
$ rustc --explain E0004

#+BEGIN_QUOTE
This error indicates that the compiler cannot guarantee a matching pattern for
one or more possible inputs to a match expression. Guaranteed matches are
required in order to assign values to match expressions, or alternatively,
determine the flow of execution. Erroneous code example:

```
enum Terminator {
    HastaLaVistaBaby,
    TalkToMyHand,
}

let x = Terminator::HastaLaVistaBaby;

match x { // error: non-exhaustive patterns: `HastaLaVistaBaby` not covered
    Terminator::TalkToMyHand => {}
}
```

If you encounter this error you must alter your patterns so that every possible
value of the input type is matched. For types with a small number of variants
(like enums) you should probably cover all cases explicitly. Alternatively, the
underscore `_` wildcard pattern can be added after all other patterns to match
"anything else". Example:

```
enum Terminator {
    HastaLaVistaBaby,
    TalkToMyHand,
}

let x = Terminator::HastaLaVistaBaby;

match x {
    Terminator::TalkToMyHand => {}
    Terminator::HastaLaVistaBaby => {}
}

// or:

match x {
    Terminator::TalkToMyHand => {}
    _ => {}
}
#+END_QUOTE
#+REVEAL: split
#+BEGIN_SRC rust
fn main() {
    let greetings = ["Hello", "안녕하세요", "Hej"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 => println!("This code is editable and runnable!"),
            1 => println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            2 => println!("Den här koden kan redigeras och köras!"),
            _ => println!("Now all our bases are covered!")
        }
    }
}
#+END_SRC

#+ATTR_REVEAL: :frag appear
- Compiler happy
- Programmer happy

