oredev_2018_rust_for_javascripters/presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Sean Grove)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/league.css" id="theme"/>

<link rel="stylesheet" href="/Users/s/Desktop/reactiveconf/talk.css"/>

<link rel="stylesheet" href="css/custom.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-org030e105">
<h2 id="org030e105">Rust for JavaScripters</h2>
</section>
</section>
<section>
<section id="slide-orgd31f9f8">
<h2 id="orgd31f9f8">Who am I?</h2>
<ul>
<li>Sean Grove (<a href="https://twitter.com/sgrove">@sgrove</a>), from SF</li>
<li>Cofounder of (<a href="https://twitter.com/onegraphio">@OneGraphIO</a>)</li>
<li>Shipped cross-compiled ARM IoT Rust project</li>
<li>Background in Clojure(Script)/Reason/Rust</li>

</ul>
</section>
</section>
<section>
<section id="slide-org14189de">
<h2 id="org14189de">The opening pitch</h2>
<p>
Working with Rust (in the beginning) is like banging your head against the wall
</p>
</section>
<section >
<p>
Let's set expectations!
</p>
<p class="fragment appear">
Caveat: Rust code will _always_※ be longer, more verbose, and more intricate than the JS alternative.
</p>





<p class="fragment appear">
※ &#x2026; not <span class="underline">always</span>, but close enough. It's a healthier mindset to go into Rust expecting thing.
</p>
</section>
</section>
<section>
<section id="slide-org987348c">
<h2 id="org987348c">The language</h2>
<blockquote nil>
<p>
Rust is a systems programming language that runs blazingly fast, prevents segfaults, and guarantees thread safety.
</p>
</blockquote>
</section>
<section >
<p>
Rust for JavaScripters:
</p>

<ul>
<li>low-level, but with abstractions</li>
<li>guaranteed memory safety</li>
<li>threads without data races</li>
<li>pattern matching</li>
<li>type inference</li>
<li>minimal runtime</li>

</ul>
</section>
<section id="slide-org4cf7fbb">
<h3 id="org4cf7fbb">Why "Low-level, but with abstractions"?</h3>
<p>
<span class="underline">Predictable performance</span> from <b>control</b> over e.g. memory layout, collection.
</p>
</section>
<section id="slide-orgf38bc01">
<h3 id="orgf38bc01">Why "Guaranteed memory safety"?</h3>
<p>
Manually ensuring data integrity is <span class="underline">tough</span>
</p>
</section>
<section id="slide-org19e9124">
<h3 id="org19e9124">Why "Threads without data races"?</h3>
<p>
Manually ensuring data integrity with <span class="underline">concurrent access</span> is <span class="underline">beyond tough</span>
</p>
</section>
<section id="slide-orgd27e1c8">
<h3 id="orgd27e1c8">Why "Type inference"?</h3>
<p class="fragment appear">
What are types for?
</p>

<ul class="fragment appear">
<li>C: Performance!</li>
<li>Typescript/flow: Correctness!</li>
<li>Rust: Correctness&#x2026; and performance!</li>

</ul>

<ul class="fragment appear">
<li>Java: Correctness&#x2026; and performance?</li>

</ul>

</section>
<section >
<div class="org-src-container">

<pre><code class="java" >public class Prime {

    public static void main(String[] args) {

        int num = 29;
        boolean flag = false;
        for(int i = 2; i <= num/2; ++i)
        {
            if(num % i == 0)
            {
                flag = true;
                break;
            }
        }

        if (!flag)
            System.out.println(num + " is a prime number.");
        else
            System.out.println(num + " is not a prime number.");
    }
}
</code></pre>
</div>
</section>
<section >
<p>
Can we do better?
</p>

<p class="fragment appear">
Type inference!
</p>
</section>
<section >

<div class="org-src-container">

<pre><code class="rust" >fn main() {
    // Because of the annotation, the compiler knows that `elem` has type u8.
    let elem = 5u8;
    // Create an empty vector (a growable array).
    let mut vec = Vec::new();
    // At this point the compiler doesn't know the exact type of `vec`, it
    // just knows that it's a vector of something (`Vec<_>`).
    // Insert `elem` in the vector.
    vec.push(elem);
    // Aha! Now the compiler knows that `vec` is a vector of `u8`s (`Vec u8`)
    println!("{:?}", vec);
}
</code></pre>
</div>

<ul class="fragment appear">
<li>Minimal type annotation of variables needed</li>

</ul>
<p class="fragment appear">
the compiler is happy
</p>
<p class="fragment appear">
and so is the programmer!
</p>
<ul class="fragment appear">
<li>Wherever possible, the computer should do work for us</li>

</ul>
</section>
<section id="slide-orgd8377ae">
<h3 id="orgd8377ae">Why "Minimal runtime"?</h3>
<p>
Delivery over the web puts pressure on payload size
</p>

<blockquote  class="fragment appear">
<p>
At present, Go generates large Wasm files, with the smallest possible size being around ~2MB. If your Go code imports libraries, this file size can increase dramatically. 10MB+ is common.
</p>
</blockquote>

<p class="fragment appear">
(Go is rapidly improving here, with TinyGo outputting e.g. ~10kB )
</p>

</section>
<section id="slide-orgc8fd249">
<h3 id="orgc8fd249">Why "Pattern matching"?</h3>
<div class="org-src-container">

<pre><code class="rust" >fn main() {
    let greetings = ["Hello", "안녕하세요", "Hej"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 => println!("This code is editable and runnable!"),
            1 => println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            2 => println!("Den här koden kan redigeras och köras!"),
        }
    }
}
</code></pre>
</div>
</section>
<section >
<p>
Not just pattern matching, <span class="underline">exhaustive pattern matching</span>!
</p>
<div class="org-src-container">

<pre><code class="rust" >fn main() {
    let greetings = ["Hello", "안녕하세요", "Hej"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 => println!("This code is editable and runnable!"),
            1 => println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            2 => println!("Den här koden kan redigeras och köras!"),
        }
    }
}
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="rust" >error[E0004]: non-exhaustive patterns: `_` not covered
--> src/main.rs:6:15
  |
6 |         match num {
  |               ^^^ pattern `_` not covered
For more information about this error, try `rustc --explain E0004`.
</code></pre>
</div>
</section>
<section >
<p>
$ rustc &#x2013;explain E0004
</p>

<blockquote nil>
<p>
This error indicates that the compiler cannot guarantee a matching pattern for
one or more possible inputs to a match expression. Guaranteed matches are
required in order to assign values to match expressions, or alternatively,
determine the flow of execution. Erroneous code example:
</p>

<p>
```
enum Terminator {
    HastaLaVistaBaby,
    TalkToMyHand,
}
</p>

<p>
let x = Terminator::HastaLaVistaBaby;
</p>

<p>
match x { // error: non-exhaustive patterns: `HastaLaVistaBaby` not covered
    Terminator::TalkToMyHand =&gt; {}
}
```
</p>

<p>
If you encounter this error you must alter your patterns so that every possible
value of the input type is matched. For types with a small number of variants
(like enums) you should probably cover all cases explicitly. Alternatively, the
underscore `_` wildcard pattern can be added after all other patterns to match
"anything else". Example:
</p>

<p>
```
enum Terminator {
    HastaLaVistaBaby,
    TalkToMyHand,
}
</p>

<p>
let x = Terminator::HastaLaVistaBaby;
</p>

<p>
match x {
    Terminator::TalkToMyHand =&gt; {}
    Terminator::HastaLaVistaBaby =&gt; {}
}
</p>

<p>
// or:
</p>

<p>
match x {
    Terminator::TalkToMyHand =&gt; {}
    _ =&gt; {}
}
</p>
</blockquote>
</section>
<section >
<div class="org-src-container">

<pre><code class="rust" >fn main() {
    let greetings = ["Hello", "안녕하세요", "Hej"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 => println!("This code is editable and runnable!"),
            1 => println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            2 => println!("Den här koden kan redigeras och köras!"),
            _ => println!("Now all our bases are covered!")
        }
    }
}
</code></pre>
</div>

<ul class="fragment appear">
<li>Compiler happy</li>
<li>Programmer happy</li>

</ul>

</section>
