oredev_2018_rust_for_javascripters/presentation.org
** "Correctness"
Debugging sucks.

From easiest to hardest:
#+ATTR_REVEAL: :frag appear
- Who should do it?
- When should it be done?
- Where should it be done?

#+REVEAL: split
Who should do it?

The Language > the compiler > the linter > the tests > the developer > the user

#+REVEAL: split
Similar to Elm, Rust pushes the debugging experience *up front*.

Very common (though not universal) that a compiling program "just works."

* The community
- Warm, welcoming community
- Strong emphasis on empathy
* Why would JavaScripters care?
#+ATTR_REVEAL: :frag appear
Combining JavaScript and Rust
#+ATTR_REVEAL: :frag appear
Caveat: Using wasm (and therefore Rust) from JS is uncomfortable and unidiomatic by default.
* Interop: A naive approach
- JavaScript initializes
- Fetch and load Rust wasm
- wasm exposes functions for JavaScript to call
- JavaScript calls wasm function which return e.g. a string
** The problem
Sending data JavaScript↔WebAssembly by default involves allocations - something we initially wanted to avoid!

#+BEGIN_SRC
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
|                   | 1. "hi!"  |2. "hi!" |                     |
|wasm.greet("hi!")  |-----------+---------> greet(msg..) {      |
|                   |           |         |        ....         |
|                   | 2. "hey!" |1. "hey!"|   "hey!"            |
|                   |<----------+---------| }                   |
+-------------------+           |         +---------------------+
#+END_SRC

#+REVEAL: split
Goals:

- Minimizing copying into and out of the WebAssembly linear memory. Unnecessary copies impose unnecessary overhead.
- Minimizing serializing and deserializing. Similar to copies, serializing and deserializing also imposes overhead, and often imposes copying as well.
* Interop: A different way of thinking.
How?
- Pass opaque handles to a data structure — instead of serializing it on one side, copy it into some known location in the WebAssembly linear memory.
- As a general rule of thumb, large, long-lived data structures are implemented as Rust types
 - They live in the Rust linear memory, and are exposed to JS as opaque handles.
 - JS calls exported Rust functions with the opaque handles
 - Rust transforms the data, perform heavy computations, queries the data
 - Rust ultimately returns a small, copy-able result.
** A house divided
#+BEGIN_SRC
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
|                   |           |         |                     |
|                   |           |         |                     |
|                   |           |         |                     |
|                   |           |         |                     |
|                   |           |         |                     |
+-------------------+           |         +---------------------+
#+END_SRC
#+REVEAL: split
#+BEGIN_SRC
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
| DOM               |           |         |                     |
| Garbage Collection|           |         |                     |
| Familiar objects  |           |         |                     |
| Arrays            |           |         |                     |
| String            |           |         |                     |
+-------------------+           |         +---------------------+
#+END_SRC
#+REVEAL: split
#+BEGIN_SRC
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
| DOM               |           |         | Performance         |
| Garbage Collection|           |         | Manual memory       |
| Familiar objects  |           |         | Custom "objects"    |
| Arrays            |           |         | Custom "arrays"+Vec |
| String            |           |         | String and str      |
+-------------------+           |         +---------------------+
#+END_SRC
*** Bridging the gap
#+BEGIN_QUOTE
> WebAssembly has a very simple memory model. A wasm module has access to a single "linear memory", which is essentially a flat array of a bytes.
#+END_QUOTE
#+REVEAL: split
#+BEGIN_SRC
+-------------------+                     +---------------------+
|JavaScript         |                     | RUST                |
+-------------------+                     +---------------------+
| DOM               |                     | Performance         |
| Garbage Collection|                     | Manual memory       |
| Familiar objects  |                     | Custom "objects"    |
| Arrays            |                     | Custom "arrays"+Vec |
| String            |                     | String and str      |
+-------+-----------+                     +----------+----------+
        |              +---------------+             |
        |              | Shared memory |             |
        |              +---------------+             |
        |              |               |             |
        |              |Plain ol' bytes|             |
        +--------------+               +-------------+
                       |               |
                       +---------------+
#+END_SRC
#+REVEAL: split
- By only returning the small result of the computation, we avoid copying and/or serializing everything back and forth between the JavaScript garbage-collected heap and the WebAssembly linear memory.
Lingua franca: [Uint8/etc.]Array
