oredev_2018_rust_for_javascripters/presentation.html
<section id="slide-org5947f85">
<h3 id="org5947f85">"Correctness"</h3>
<p>
Debugging sucks.
</p>

<p>
From easiest to hardest:
</p>
<ul class="fragment appear">
<li>Who should do it?</li>
<li>When should it be done?</li>
<li>Where should it be done?</li>

</ul>

</section>
<section >
<p>
Who should do it?
</p>

<p>
The Language &gt; the compiler &gt; the linter &gt; the tests &gt; the developer &gt; the user
</p>

</section>
<section >
<p>
Similar to Elm, Rust pushes the debugging experience <b>up front</b>.
</p>

<p>
Very common (though not universal) that a compiling program "just works."
</p>

</section>
</section>
<section>
<section id="slide-org91a9c37">
<h2 id="org91a9c37">The community</h2>
<ul>
<li>Warm, welcoming community</li>
<li>Strong emphasis on empathy</li>

</ul>
</section>
</section>
<section>
<section id="slide-org0cff892">
<h2 id="org0cff892">Why would JavaScripters care?</h2>
<p class="fragment appear">
Combining JavaScript and Rust
</p>
<p class="fragment appear">
Caveat: Using wasm (and therefore Rust) from JS is uncomfortable and unidiomatic by default.
</p>
</section>
</section>
<section>
<section id="slide-org3f7105a">
<h2 id="org3f7105a">Interop: A naive approach</h2>
<ul>
<li>JavaScript initializes</li>
<li>Fetch and load Rust wasm</li>
<li>wasm exposes functions for JavaScript to call</li>
<li>JavaScript calls wasm function which return e.g. a string</li>

</ul>
</section>
<section id="slide-orga7c0bd3">
<h3 id="orga7c0bd3">The problem</h3>
<p>
Sending data JavaScript↔WebAssembly by default involves allocations - something we initially wanted to avoid!
</p>

<pre  class="example">
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
|                   | 1. "hi!"  |2. "hi!" |                     |
|wasm.greet("hi!")  |-----------+---------&gt; greet(msg..) {      |
|                   |           |         |        ....         |
|                   | 2. "hey!" |1. "hey!"|   "hey!"            |
|                   |&lt;----------+---------| }                   |
+-------------------+           |         +---------------------+
</pre>

</section>
<section >
<p>
Goals:
</p>

<ul>
<li>Minimizing copying into and out of the WebAssembly linear memory. Unnecessary copies impose unnecessary overhead.</li>
<li>Minimizing serializing and deserializing. Similar to copies, serializing and deserializing also imposes overhead, and often imposes copying as well.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org94075c1">
<h2 id="org94075c1">Interop: A different way of thinking.</h2>
<p>
How?
</p>
<ul>
<li>Pass opaque handles to a data structure — instead of serializing it on one side, copy it into some known location in the WebAssembly linear memory.</li>
<li>As a general rule of thumb, large, long-lived data structures are implemented as Rust types
<ul>
<li>They live in the Rust linear memory, and are exposed to JS as opaque handles.</li>
<li>JS calls exported Rust functions with the opaque handles</li>
<li>Rust transforms the data, perform heavy computations, queries the data</li>
<li>Rust ultimately returns a small, copy-able result.</li>

</ul></li>

</ul>
</section>
<section id="slide-orgb341ef9">
<h3 id="orgb341ef9">A house divided</h3>
<pre  class="example">
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
|                   |           |         |                     |
|                   |           |         |                     |
|                   |           |         |                     |
|                   |           |         |                     |
|                   |           |         |                     |
+-------------------+           |         +---------------------+
</pre>
</section>
<section >
<pre  class="example">
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
| DOM               |           |         |                     |
| Garbage Collection|           |         |                     |
| Familiar objects  |           |         |                     |
| Arrays            |           |         |                     |
| String            |           |         |                     |
+-------------------+           |         +---------------------+
</pre>
</section>
<section >
<pre  class="example">
+-------------------+           |         +---------------------+
|JavaScript         |           |         | RUST                |
+-------------------+           |         +---------------------+
| DOM               |           |         | Performance         |
| Garbage Collection|           |         | Manual memory       |
| Familiar objects  |           |         | Custom "objects"    |
| Arrays            |           |         | Custom "arrays"+Vec |
| String            |           |         | String and str      |
+-------------------+           |         +---------------------+
</pre>
</section>
<section id="slide-org3b747f3">
<h4 id="org3b747f3">Bridging the gap</h4>
<blockquote nil>
<p>
&gt; WebAssembly has a very simple memory model. A wasm module has access to a single "linear memory", which is essentially a flat array of a bytes.
</p>
</blockquote>
</section>
<section >
<pre  class="example">
+-------------------+                     +---------------------+
|JavaScript         |                     | RUST                |
+-------------------+                     +---------------------+
| DOM               |                     | Performance         |
| Garbage Collection|                     | Manual memory       |
| Familiar objects  |                     | Custom "objects"    |
| Arrays            |                     | Custom "arrays"+Vec |
| String            |                     | String and str      |
+-------+-----------+                     +----------+----------+
        |              +---------------+             |
        |              | Shared memory |             |
        |              +---------------+             |
        |              |               |             |
        |              |Plain ol' bytes|             |
        +--------------+               +-------------+
                       |               |
                       +---------------+
</pre>
</section>
<section >
<ul>
<li>By only returning the small result of the computation, we avoid copying and/or serializing everything back and forth between the JavaScript garbage-collected heap and the WebAssembly linear memory.</li>

</ul>
<p>
Lingua franca: [Uint8/etc.]Array
</p>
</section>
